duxinglang-1/nRF9160_test/E2_V3_TEST/src/screen/screen.c
void IdleShowSystemDate(void)
{
	uint16_t x,y,w,h;
	uint8_t str_date[20] = {0};
	uint8_t tmpbuf[128] = {0};
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_mon[LANGUAGE_MAX][12][5] = {
										{
											{0x004A,0x0061,0x006E,0x0000,0x0000},//"Jan"
											{0x0046,0x0065,0x0062,0x0000,0x0000},//"Feb"
											{0x004D,0x0061,0x0072,0x0000,0x0000},//"Mar"
											{0x0041,0x0070,0x0072,0x0000,0x0000},//"Apr"
											{0x004D,0x0061,0x0079,0x0000,0x0000},//"May"
											{0x004A,0x0075,0x006E,0x0000,0x0000},//"Jun"
											{0x004A,0x0075,0x006C,0x0000,0x0000},//"Jul"
											{0x0041,0x0075,0x0067,0x0000,0x0000},//"Aug"
											{0x0053,0x0065,0x0070,0x0074,0x0000},//"Sept"
											{0x004F,0x0063,0x0074,0x0000,0x0000},//"Oct"
											{0x004E,0x006F,0x0076,0x0000,0x0000},//"Nov"
											{0x0044,0x0065,0x0063,0x0000,0x0000} //"Dec"
										},
										{
											{0x004A,0x0061,0x006E,0x0000,0x0000},//"Jan"
											{0x0046,0x0065,0x0062,0x0000,0x0000},//"Feb"
											{0x004D,0x00E4,0x0072,0x007A,0x0000},//"M鋜z"
											{0x0041,0x0070,0x0072,0x0000,0x0000},//"Apr"
											{0x004D,0x0061,0x0069,0x0000,0x0000},//"Mai"
											{0x004A,0x0075,0x006E,0x0000,0x0000},//"Jun"
											{0x004A,0x0075,0x006C,0x0000,0x0000},//"Jul"
											{0x0041,0x0075,0x0067,0x0000,0x0000},//"Aug"
											{0x0053,0x0065,0x0070,0x0074,0x0000},//"Sept"
											{0x004F,0x006B,0x0074,0x0000,0x0000},//"Okt"
											{0x004E,0x006F,0x0076,0x0000,0x0000},//"Nov"
											{0x0044,0x0065,0x007A,0x0000,0x0000} //"Dez"
										},
										{
											{0x004A,0x0061,0x006E,0x0000,0x0000},//"Jan"
											{0x0046,0x0065,0x0062,0x0000,0x0000},//"Feb"
											{0x004D,0x0061,0x0072,0x0000,0x0000},//"Mar"
											{0x0041,0x0070,0x0072,0x0000,0x0000},//"Apr"
											{0x004D,0x0061,0x0079,0x0000,0x0000},//"May"
											{0x004A,0x0075,0x006E,0x0000,0x0000},//"Jun"
											{0x004A,0x0075,0x006C,0x0000,0x0000},//"Jul"
											{0x0041,0x0075,0x0067,0x0000,0x0000},//"Aug"
											{0x0053,0x0065,0x0070,0x0074,0x0000},//"Sept"
											{0x004F,0x0063,0x0074,0x0000,0x0000},//"Oct"
											{0x004E,0x006F,0x0076,0x0000,0x0000},//"Nov"
											{0x0044,0x0065,0x0063,0x0000,0x0000} //"Dec"
										},
									};
#else	
	uint8_t *str_mon[12] = {"Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sept","Oct","Nov","Dec"};
#endif

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_36);

	LCD_FillColor(IDLE_DATE_DAY_X, IDLE_DATE_DAY_Y, IDLE_DATE_DAY_W, IDLE_DATE_DAY_H, BLACK);
	sprintf((char*)str_date, "%02d", date_time.day);
	mmi_asc_to_ucs2(tmpbuf, str_date);
	LCD_ShowUniString(IDLE_DATE_DAY_X, IDLE_DATE_DAY_Y, (uint16_t*)tmpbuf);

	LCD_FillColor(IDLE_DATE_MON_X, IDLE_DATE_MON_Y, IDLE_DATE_MON_W, IDLE_DATE_MON_H, BLACK);
	LCD_ShowUniString(IDLE_DATE_MON_X, IDLE_DATE_MON_Y, str_mon[global_settings.language][date_time.month-1]);
#else
	LCD_SetFontSize(FONT_SIZE_32);

	sprintf((char*)str_date, "%02d", date_time.day);
	LCD_ShowString(IDLE_DATE_DAY_X,IDLE_DATE_DAY_Y,str_date);
	strcpy((char*)str_date, str_mon[date_time.month-1]);
	LCD_ShowString(IDLE_DATE_MON_X,IDLE_DATE_MON_Y,str_date);
#endif
}

void IdleShowBleStatus(bool flag)
{
	if(flag)
	{
		//LCD_ShowImg(IDLE_BLE_X, IDLE_BLE_Y, IMG_BLE_LINK);
		LCD_ShowString(IDLE_BLE_X,IDLE_BLE_Y,"BLE");
	}
	else
	{
		//LCD_ShowImg(IDLE_BLE_X, IDLE_BLE_Y, IMG_BLE_UNLINK);
		LCD_ShowString(IDLE_BLE_X,IDLE_BLE_Y,"   ");
	}
}

void IdleShowSystemTime(void)
{
	static bool flag = true;
	uint16_t x,y,w,h;
	uint8_t str_time_h[4] = {0};
	uint8_t str_time_m[4] = {0};
	uint8_t str_time_dot[4] = {0};
	uint8_t str_ampm[5] = {0};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_68);
#else
	LCD_SetFontSize(FONT_SIZE_64);
#endif

	switch(global_settings.time_format)
	{
	case TIME_FORMAT_24:
		sprintf((char*)str_time_h, "%02d", date_time.hour);
		break;

	case TIME_FORMAT_12:
		sprintf((char*)str_time_h, "%02d", (date_time.hour>12 ? (date_time.hour-12):date_time.hour));
		break;
	}
	sprintf((char*)str_time_m, "%02d", date_time.minute);

	if(flag)
		strcpy((char*)str_time_dot, ":");
	else
		strcpy((char*)str_time_dot, " ");
	
	flag = !flag;
	
	x = IDLE_TIME_X;
	y = IDLE_TIME_Y;
	LCD_ShowString(x,y,str_time_h);
	LCD_ShowString(x+68,y-4,str_time_dot);
	LCD_ShowString(x+86,y,str_time_m);
}

void IdleShowSystemWeek(void)
{
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_week[LANGUAGE_MAX][7][4] = {
										{
											{0x0053,0x0075,0x006E,0x0000},//"Sun"
											{0x004D,0x006F,0x006E,0x0000},//"Mon"
											{0x0054,0x0075,0x0065,0x0000},//"Tue"
											{0x0057,0x0065,0x0064,0x0000},//"Wed"
											{0x0054,0x0068,0x0075,0x0000},//"Thu"
											{0x0046,0x0072,0x0069,0x0000},//"Fri"
											{0x0053,0x0061,0x0074,0x0000} //"Sat"
										},
										{
											{0x0053,0x006F,0x0000},//So
											{0x004D,0x006F,0x0000},//Mo
											{0x0044,0x0049,0x0000},//DI
											{0x004D,0x0049,0x0000},//MI
											{0x0044,0x006F,0x0000},//Do
											{0x0046,0x0072,0x0000},//Fr
											{0x0053,0x0061,0x0000} //Sa
										},
										{
		 									{0x65E5,0x0000},//"日"
											{0x4E00,0x0000},//"一"
											{0x4E8C,0x0000},//"二"
											{0x4E09,0x0000},//"三"
											{0x56DB,0x0000},//"四"
											{0x4E94,0x0000},//"五"
											{0x516D,0x0000} //"六"
										},
									};
#else
	uint8_t str_week[128] = {0};
#endif
	
	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_36);
	LCD_FillColor(IDLE_WEEK_X, IDLE_WEEK_Y, IDLE_WEEK_W, IDLE_WEEK_H, BLACK);
	LCD_ShowUniString(IDLE_WEEK_X, IDLE_WEEK_Y, str_week[global_settings.language][date_time.week]);
#else
	LCD_SetFontSize(FONT_SIZE_32);
	GetSystemWeekStrings(str_week);
	LCD_ShowString(IDLE_WEEK_X, IDLE_WEEK_Y, str_week);
#endif
}

void IdleShowDateTime(void)
{
	IdleShowSystemTime();
	IdleShowSystemDate();
	IdleShowSystemWeek();
}

void IdleUpdateBatSoc(void)
{
	static bool flag = true;
	uint16_t w,h;
	uint8_t strbuf[128] = {0};

	if(g_bat_soc >= 100)
		sprintf(strbuf, "%d%%", g_bat_soc);
	else if(g_bat_soc >= 10)
		sprintf(strbuf, "   %d%%", g_bat_soc);
	else
		sprintf(strbuf, "      %d%%", g_bat_soc);

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif

